


* temporary [7/7]
  SCHEDULED: <2016-10-19 周三>
  CLOCK: [2016-10-19 周三 09:42]--[2016-10-19 周三 09:44] =>  0:02
** DONE 3a r10809-1...r10810-1
   CLOSED: [2016-10-28 周五 12:07]
   - State "DONE"       from "TODO"       [2016-10-28 周五 12:07]
   - State "TODO"       from ""           [2016-10-25 周二 21:43]
** DONE [#A] 修改答辩ppt
   CLOSED: [2016-11-03 周四 15:42] SCHEDULED: 
   - State "DONE"       from "TODO"       [2016-11-03 周四 15:42]
   CLOCK: [2016-10-19 周三 14:50]--[2016-10-19 周三 15:18] =>  0:28
   CLOCK: [2016-10-19 周三 12:05]--[2016-10-19 周三 14:50] =>  2:45
   - State "TODO"       from "DONE"       [2016-10-19 周三 09:11]
*** DONE 例子加上数据、对比   多加几个例子
**** DONE PD1515BA清晰度噪点
 - [X] 借机
 - [X] 改参数
 - [X] 拍照
**** DONE 1419CL 偏色


* 出差长安记得带回去的 [0/5]
  SCHEDULED: <2016-10-16 周日>
 - [ ] 台式机 x2
 - [ ] 插板 x1
 - [ ] 充电头 x1
 - [ ] 数据线 x3 （康丽 x1 ）
 - [ ] PD1415D PD1415BA



* 项目
#+TAGS: @bug(b)
#+TAGS: @量产前必解(x)
#+TODO: TODO(t@/!) 新的(1@/!) 正在处理(2@/!) 重新打开(3@/!) 延后处理(4@/!) | DONE(d@/!) 解决待关闭(5@/!) 不做处理(6@/!) 退回(7@/!) 关闭(8@/!) 转给他人(9@/!)
** PD1619F_EX[1/1]
*** DONE PD1619F_EX移植安奇逻辑算法
    CLOSED: [2016-11-03 周四 16:35] SCHEDULED: <2016-11-03 周四>
    - State "DONE"       from "TODO"       [2016-11-03 周四 16:35]
    - State "TODO"       from "DONE"       [2016-11-03 周四 16:35]
    - State "DONE"       from "TODO"       [2016-11-03 周四 15:43]
    - State "TODO"       from ""           [2016-11-02 周三 17:28]

** PD1616 [19/19] 
   SCHEDULED: <2016-10-31 周一>
   - State "TODO"       from ""           [2016-10-19 周三 09:16]

*** 解决待关闭 [B161026-120] 3800K强闪偏蓝                      :@bug:@量产前必解:
    CLOSED: [2016-10-29 周六 20:13] DEADLINE: <2016-10-29 周六>
    - State "解决待关闭" from "正在处理"   [2016-10-29 周六 20:13]
    - State "正在处理"   from "新的"       [2016-10-29 周六 15:26]
    - State "新的"       from "TODO"       [2016-10-29 周六 15:12]
    - State "TODO"       from ""           [2016-10-28 周五 11:55]
*** 解决待关闭 [B161026-117] ISO 人物偏灰                       :@bug:@量产前必解:
    CLOSED: [2016-10-29 周六 20:12] DEADLINE: <2016-10-29 周六>
    - State "解决待关闭" from "正在处理"   [2016-10-29 周六 20:12]
    - State "正在处理"   from "新的"       [2016-10-29 周六 15:26]
    - State "新的"       from "TODO"       [2016-10-29 周六 15:12]
    - State "TODO"       from ""           [2016-10-28 周五 11:54]
*** 解决待关闭 [B161026-206] 用例10模式切换                     :@bug:@量产前必解:
    CLOSED: [2016-10-29 周六 20:09] DEADLINE: <2016-10-29 周六>
    - State "解决待关闭" from "正在处理"   [2016-10-29 周六 20:09]
    - State "正在处理"   from "新的"       [2016-10-29 周六 15:26]
    - State "新的"       from "TODO"       [2016-10-29 周六 15:12]
    - State "TODO"       from ""           [2016-10-28 周五 11:48]
    - v-85b175f59314fc9a1ff74c038ed7b5e52c90e405
    - aec_process.c:3903
*** 解决待关闭 [B161024-461] AcuteLogic face 除零               :@bug:@量产前必解:
    CLOSED: [2016-10-29 周六 20:11] DEADLINE: <2016-10-29 周六>
    - State "解决待关闭" from "正在处理"   [2016-10-29 周六 20:11]
    - State "正在处理"   from "新的"       [2016-10-29 周六 15:26]
    - State "新的"       from "TODO"       [2016-10-29 周六 15:16]
    - State "TODO"       from ""           [2016-10-25 周二 21:42]
    - 安奇逻辑下一版解
*** DONE raw 图 [4/4]
    CLOSED: [2016-11-03 周四 15:43] DEADLINE: <2016-10-20 周四>
    - State "DONE"       from "TODO"       [2016-11-03 周四 15:43] \\
      高通建议方式是选最亮的点
      安奇逻辑使用的是中心区域
    - State "TODO"       from ""           [2016-10-19 周三 16:56]
    - [X] 提供图片
    - [X] 提供数据
    - [X] 计算逻辑
      - 看不懂
    - [X] 模组厂重新提供 DLL
      - 已调用
*** 不做处理 [B161018-700] AcuteLogic segment fault                    :@bug:
    CLOSED: [2016-10-20 周四 17:20] SCHEDULED: <2016-10-20 周四>
    - State "不做处理"   from "DONE"       [2016-10-29 周六 15:17]
    - State "DONE"       from "TODO"       [2016-10-20 周四 17:20] \\
      安奇逻辑分析为 log 太多导致
      关掉 log 即可
      于是不作处理
    - State "TODO"       from ""           [2016-10-19 周三 10:17]
      已发送邮件给安奇逻辑
*** DONE 把保密外壳的螺钉装上
*** DONE 拷10.15~10.17的照片
*** DONE 王永国，明度xxxx
 - [X] 图片偏暗，问潘陈军
*** DONE very_limit -> 旷伟 （给到模组和手机）[6/6]
 - [X] 室外（上下午都可以，不要晚上）
 - [X] 室内（办公室）
 - [X] 模拟kfc
 - [X] 灯箱标准光源（色卡）
 - [X] 已发单
 - [X] 拷贝图片给安奇逻辑
*** DONE 和安奇逻辑沟通 [2/2]
 - [X] 问题点图片是没图片，还是不清楚图片里边是什么问题
   - 没有图片
   - 不知道图片的问题是什么
 - [X] 录像的找小刚提供
*** DONE otp 偏差 [4/4]
 - [X] 问安奇逻辑能否关掉
   - 已提供库文件
 - [X] 借机复现
 - [X] 对比效果
 - [X] 讨论对策
   - 如果A光源可靠，不作处理
   - 如果A光源不可靠，使用一点校准替换之前使用的二点校准
*** DONE otp管控范围之外（模组厂管控之内）[3/3]
 - [X] 和安奇逻辑确认验证方法
   - 需要提供模组拍 raw 图片确认是否在算法逻辑之内
 - [X] 问程传波拿到模组
   - 已经给潘陈军了
 - [X] 问潘陈军拿到模组
 - 已找到偏差最大的模组（7#）并交给安奇逻辑
*** DONE 修改宏控 : 和1616相关的地方都加上 "PD1624"
*** DONE awb bug 解决时间（按场景分）[2/2]
 - [X] 对比两份bug，给到金杰
 - [X] 要求按场景，给出解决时间
*** DONE 找旷伟安排 2016.10.11( 明天 ) 日出 ( 偏蓝 ) [3/3]
 - [X] 发单
 - [X] 刷机
 - [X] push 库文件并验证 exif 信息
*** 关闭 [B161009-455] 手动白平衡 2300K [4/4]                          :@bug:
    - State "关闭"       from "DONE"       [2016-10-29 周六 15:18]
 - [X] 刷机
 - [X] 验证
 - 转给杨涛看
 - 已告知求明，杨涛
 - 已告知安奇逻辑
 - [X] set_parm_whitebalance 不应该被调用到 
 - [X] 处理不了，交给安奇逻辑
   - 已做兼容
*** 关闭 [B160930-465] log管控 [2/2]                                   :@bug:
    - State "关闭"       from "DONE"       [2016-10-29 周六 15:18]
 - [X] 刷机
 - [X] 验证
 - 下一版设成自动关闭
*** 解决待关闭 [B161011-671] 调节曝光补偿                              :@bug:
    - State "解决待关闭" from "DONE"       [2016-10-29 周六 15:19]
 - 同 B161010-854 已做规避


   
** PD1616LG4 [2/2] 
*** 关闭 [B160922-269] 像面色彩均匀度 [1/1]                            :@bug:
    - State "关闭"       from "DONE"       [2016-10-29 周六 15:19]
 - [X] 用最新每日编译试试看 shading 问题
   - 还是有 shading 问题
 - [X] 确认算法库是否调用到专用的
   - 调用到了
 - [X] 改 meshrolloff 试试
   - 有用
 - [X] 问陈军怎么解: LG4 不用这个功能 还是找问题出在哪
   - 陈军 : LG4 改成不用
 - [X] 提供 meshrolloff 的版本
 - [X] 提供 f3 版本 + no_meshrolloff 给廖秒干
   - 进入相机方式不同颜色差异很大
**** 关闭 两套参数接口 [4/4]
     - State "关闭"       from "DONE"       [2016-10-29 周六 15:19]
 - [X] 拟制方案
   项目宏控
 - [X] 发邮件确认
   + 标准
   + 接口事宜
   + 例子图片
 - [X] 提供无法开机的log
 - [X] 换成读取系统属性
*** 关闭 [B161010-854] 调节曝光补偿 [4/4]                              :@bug:
    - State "关闭"       from "DONE"       [2016-10-29 周六 15:19]
 - [X] 刷机
 - [X] 验证
   - 验证不出来，转给求明
 - [X] 求明:3a段错误
 - [X] 祥玉:加规避


** PD1617/PD1619 [10/10] 
   SCHEDULED: <2016-12-02 周五>
   - State "TODO"       from ""           [2016-10-19 周三 09:16]
*** 关闭 [B161023-299] ev_extend                                       :@bug:
    CLOSED: [2016-10-29 周六 15:16]
    - State "关闭"       from "解决待关闭" [2016-10-31 周一 11:36]
    - State "解决待关闭" from "TODO"       [2016-10-29 周六 15:16]
    - State "TODO"       from ""           [2016-10-28 周五 12:03]
*** 解决待关闭 [B161023-233] HDR 偏蓝                                  :@bug:
    CLOSED: [2016-10-29 周六 20:16]
    - State "解决待关闭" from "正在处理"   [2016-10-29 周六 20:16]
    - State "正在处理"   from "TODO"       [2016-10-29 周六 15:15]
    - State "TODO"       from ""           [2016-10-28 周五 12:01]
    - 安奇逻辑下一版解
*** DONE 寄1617、1619回去给永富
    CLOSED: [2016-10-25 周二 09:19]
    - State "DONE"       from "TODO"       [2016-10-25 周二 09:19]
    - State "TODO"       from ""           [2016-10-24 周一 17:50]
*** DONE 新机器发放行单
    CLOSED: [2016-10-24 周一 22:46]
    - State "DONE"       from "TODO"       [2016-10-24 周一 22:46]
    - State "TODO"       from ""           [2016-10-24 周一 10:06]
*** DONE 拆机换 golden
    CLOSED: [2016-10-24 周一 17:50]
    - State "DONE"       from "TODO"       [2016-10-24 周一 17:50]
    - State "TODO"       from ""           [2016-10-24 周一 10:06]
*** DONE 给海叔编个库 
*** DONE 添加76pro的代码 
*** DONE 寄往日本的 golden 手机状态
    PD1617_A_A09.30.07
*** DONE porting checklist [11/11]
   - [X] 验证、添加项目宏控
   - [X]  区分前后置
   - [X]  device-vendor.mk
   - [X]  工模使用q3a
   - [X]  prebuilt_HY11
   - [X]  调用 ext_lib
   - [X]  roi&face
   - [X]  aec_param
   - [X]  otp->wbc
   - [X]  led calibration
   - [X]  mcas
*** DONE 2016.10.10 给出 golden


** PD1621 [1/1] 
*** 解决待关闭 [B161018-885] 用例13滤镜                         :@bug:@量产前必解:
    CLOSED: [2016-10-29 周六 20:25] DEADLINE: <2016-10-29 周六>
    - State "解决待关闭" from "正在处理"   [2016-10-29 周六 20:25]
    - State "正在处理"   from "TODO"       [2016-10-29 周六 15:11]
    - State "TODO"       from ""           [2016-10-28 周五 11:46]
    - aec_process.c:1983



** TD1605(8917) [1/1]
*** 转给他人 [B161019-587] ev_range                                    :@bug:
    CLOSED: [2016-10-29 周六 15:01]
    - State "转给他人"   from "解决待关闭" [2016-10-29 周六 15:21] \\
      低端平台不维护3a代码
      转给求明
      给高通提case
    - State "解决待关闭" from "DONE"       [2016-10-29 周六 15:10]
    - State "DONE"       from "TODO"       [2016-10-29 周六 15:01]
    - State "TODO"       from ""           [2016-10-28 周五 12:06]

